_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ОбъектнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыСметныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыСметныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактированиеЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ШаблоныЛимитированныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ШаблоныЛимитированныхЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
#Область ОбработкиНажатия

&НаКлиенте
Процедура ДобавитьЛС(Команда)
	
	// Получаем массив ЛС из ТЧ
	МассивОС = Новый Массив;
	Для Каждого ТекСтрока Из Объект.ЛокальныеСметы Цикл
		МассивОС.Добавить(ТекСтрока.ЛокальнаяСмета);
	КонецЦикла;

	ОтборСмет = Новый Структура("МассивОС,Стройка",МассивОС,Объект.Стройка);
	ОткрытьФорму("Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораУпр",ОтборСмет,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда
		Если ИсточникВыбора.ИмяФормы = "Документ.СМ_ОбъектнаяСмета.Форма.ФормаПодбораЛимитированныхЗатрат" Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				Если ВыбранноеЗначение.Количество() > 0 Тогда   
					Для Каждого ТекЭлемент Из ВыбранноеЗначение Цикл
						НоваяСтрока = Объект.ЛимитированныеЗатраты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекЭлемент);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СМ_ШаблоныЛимитированныхЗатрат.Форма.ФормаВыбора" Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СМ_ШаблоныЛимитированныхЗатрат") Тогда
				ЗаполнитьТЧСтрокамиШаблонаЛЗ(ВыбранноеЗначение);
			КонецЕсли;
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораУпр" Тогда	
			ТекСч = Объект.ЛокальныеСметы.Количество();
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				Если ВыбранноеЗначение.Количество() > 0 Тогда   
					Для Каждого ТекЭлемент Из ВыбранноеЗначение Цикл
						ТекСч 							= ТекСч + 1;
						НоваяСтрока 					= Объект.ЛокальныеСметы.Добавить();
						НоваяСтрока.ЛокальнаяСмета 		= ТекЭлемент;
						НоваяСтрока.КоличествоОбъектов 	= 1;
						НоваяСтрока.НомерПП				= ТекСч;
						НоваяСтрока.Расчет				= Истина;
						ОбработатьЛимЗатратыСметы(ТекЭлемент);
					КонецЦикла;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
					ТекСч 							= ТекСч + 1;
					НоваяСтрока 					= Объект.ЛокальныеСметы.Добавить();
					НоваяСтрока.ЛокальнаяСмета 		= ВыбранноеЗначение;
					НоваяСтрока.КоличествоОбъектов 	= 1;
					НоваяСтрока.НомерПП				= ТекСч;
					НоваяСтрока.Расчет				= Истина;
					ОбработатьЛимЗатратыСметы(ВыбранноеЗначение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;  
		ЭтаФорма.Модифицированность = Истина;
		ОбновитьДеревоОС(); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧСтрокамиШаблонаЛЗ(ВыбранноеЗначение)
	
	ТекОбъект 	= ВыбранноеЗначение.ПолучитьОбъект();
	ТекОбъектОС = РеквизитФормыВЗначение("Объект");
	
	Для Каждого СтрокаЛЗ Из ТекОбъект.ЛимитированныеЗатраты Цикл
		ТекСтрока = ТекОбъектОС.ЛимитированныеЗатраты.Найти(СтрокаЛЗ.ЛимЗатрата); 
		Если ТекСтрока <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока 						= Объект.ЛимитированныеЗатраты.Добавить();
		НоваяСтрока.ЛимитированнаяЗатрата 	= СтрокаЛЗ.ЛимЗатрата;
		НоваяСтрока.Расчет 					= Истина;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ВывестиСоставОС()
	
	СоставСметы.Очистить();
	
	КолЗнаков = 2;
	Если Объект.ПроводитьОкругление = Истина Тогда
		КолЗнаков = Объект.ФорматОкругления;		
	КонецЕсли;
	
	ТекОбъект 	= РеквизитФормыВЗначение("Объект");
	ТекМакет 	= ТекОбъект.ПолучитьМакет("ПФ_MXL_МакетОС");
	
	МассивЛС 	= ТекОбъект.ЛокальныеСметы.ВыгрузитьКолонку("ЛокальнаяСмета"); 
	ТекОС	 	= Объект.Ссылка;
	
	ВТекущихЦенах = Истина;
	Если Объект.БазисныеЦены Тогда
		ВТекущихЦенах = Ложь;	
	КонецЕсли;
	
	ТабЛС = СМ_СметныйСоставВызовСервера.ПолучитьИтогиПоВидамРабот(ТекОС,МассивЛС,ВТекущихЦенах);
	
	ОбластьШапка 		= ТекМакет.ПолучитьОбласть("ШапкаЛС");
	ОбластьЗаголовокЛС  = ТекМакет.ПолучитьОбласть("ВерхЛС");
	ОбластьСтрокаЛС     = ТекМакет.ПолучитьОбласть("СтрокаЛС");
	ОбластьИтогЛС       = ТекМакет.ПолучитьОбласть("ИтогЛС");
	
	СоставСметы.Вывести(ОбластьШапка);	
	СоставСметы.Вывести(ОбластьЗаголовокЛС);
	
	ТекКартинка = БиблиотекаКартинок.СинхронизацияДанных;
	
	СтруктураИтогов = Новый Структура;
	СтруктураИтогов.Вставить("СтроительныеРаботы",0);
	СтруктураИтогов.Вставить("МонтажныеРаботы",0);
	СтруктураИтогов.Вставить("Оборудование",0);
	СтруктураИтогов.Вставить("Прочие",0);
	СтруктураИтогов.Вставить("ОплатаТруда",0);
	СтруктураИтогов.Вставить("ВсегоПоСтроке",0);
	
	Для Каждого ТекСтрока Из ТабЛС Цикл
		
		ОбластьСтрокаЛС.Параметры.НаименованиеЛокальнойСметы 	= СокрЛП(ТекСтрока.Смета.Наименование); 
		ОбластьСтрокаЛС.Параметры.ТекКартинка 					= ТекКартинка;
		ОбластьСтрокаЛС.Параметры.НомерСметы					= ТекСтрока.Смета.НомерСметы;
		ОбластьСтрокаЛС.Параметры.МонтажныеРаботы 				= Окр(ТекСтрока.МонтажныеРаботы/1000,КолЗнаков);
		ОбластьСтрокаЛС.Параметры.Оборудование          		= Окр(ТекСтрока.Оборудование/1000,КолЗнаков);
		ОбластьСтрокаЛС.Параметры.ОплатаТруда           		= Окр(ТекСтрока.ОплатаТруда/1000,КолЗнаков);
		ОбластьСтрокаЛС.Параметры.Прочие                		= Окр(ТекСтрока.Прочие/1000,КолЗнаков);
		ОбластьСтрокаЛС.Параметры.СтроительныеРаботы			= Окр(ТекСтрока.СтроительныеРаботы/1000,КолЗнаков);
		ОбластьСтрокаЛС.Параметры.ВсегоПоСтроке 				= ОбластьСтрокаЛС.Параметры.СтроительныеРаботы + ОбластьСтрокаЛС.Параметры.МонтажныеРаботы + ОбластьСтрокаЛС.Параметры.Оборудование + ОбластьСтрокаЛС.Параметры.Прочие;
		
		СоставСметы.Вывести(ОбластьСтрокаЛС);	
				
		СтруктураИтогов.СтроительныеРаботы = СтруктураИтогов.СтроительныеРаботы + ОбластьСтрокаЛС.Параметры.СтроительныеРаботы;
		СтруктураИтогов.МонтажныеРаботы    = СтруктураИтогов.МонтажныеРаботы + ОбластьСтрокаЛС.Параметры.МонтажныеРаботы;
		СтруктураИтогов.Оборудование       = СтруктураИтогов.Оборудование + ОбластьСтрокаЛС.Параметры.Оборудование;
		СтруктураИтогов.Прочие             = СтруктураИтогов.Прочие + ОбластьСтрокаЛС.Параметры.Прочие;
		СтруктураИтогов.ОплатаТруда        = СтруктураИтогов.ОплатаТруда + ОбластьСтрокаЛС.Параметры.ОплатаТруда;
		СтруктураИтогов.ВсегоПоСтроке      = СтруктураИтогов.ВсегоПоСтроке + ОбластьСтрокаЛС.Параметры.ВсегоПоСтроке;
		
	КонецЦикла;
	
	ОбластьИтогЛС.Параметры.Заполнить(СтруктураИтогов);
	СоставСметы.Вывести(ОбластьИтогЛС);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровЛЗ()
	
	ТекОбъект 				= РеквизитФормыВЗначение("Объект");
	СписокЛЗ 				= ТекОбъект.ЛимитированныеЗатраты.ВыгрузитьКолонку("ЛимитированнаяЗатрата");
	СтруктураПараметровЛЗ 	= Новый Структура("СписокЛЗ, МетодикаРасчета",СписокЛЗ, Объект.МетодикаРасчета);
	
	Возврат СтруктураПараметровЛЗ; 
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЛЗ(Команда)
	
	СтруктураПараметровЛЗ 	= ПолучитьСтруктуруПараметровЛЗ();
	ОткрытьФорму("Документ.СМ_ОбъектнаяСмета.Форма.ФормаПодбораЛимитированныхЗатрат",СтруктураПараметровЛЗ,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛЗПоШаблону(Команда)
	
	Если Объект.ЛимитированныеЗатраты.Количество()>0 Тогда
		
		ТекстВопроса = НСтр("ru='При вставке шаблона будут удалены уже введенные лимитированные затраты! 
		|Продолжать (Кнопка ""Да"") ? Кнопка ""Нет"" отказ.'");
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаШаблон", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе
		ОЗакрытииФормыВыбораШаблона = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблона",ЭтаФорма);
		ОткрытьФорму("Справочник.СМ_ШаблоныЛимитированныхЗатрат.ФормаВыбора",,ЭтаФорма,,,,ОЗакрытииФормыВыбораШаблона,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаШаблон(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	ОЗакрытииФормыВыбораШаблона = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблона",ЭтаФорма);
	ОткрытьФорму("Справочник.СМ_ШаблоныЛимитированныхЗатрат.ФормаВыбора",,ЭтаФорма,,,,ОЗакрытииФормыВыбораШаблона,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура ОчиститьЛЗНаСервере()
	
	Попытка
		ОчиститьИдРодителяЛС();
		Объект.ЛокальныеСметы.Очистить();
		Объект.ЛимитированныеЗатраты.Очистить();
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Произошла ошибка при очистке табличных частей объекта'"));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛЗ(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
	ПоказатьВопрос(Оповещение, НСтр("ru='Будут очищены табличные части ""Локальные сметы"" и ""Лимитированные затраты"", продолжить?'"), Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОчистка(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	ОчиститьЛЗНаСервере();
	ОбновитьДеревоОС();

КонецПроцедуры

&НаСервере
Процедура СтрокаВверхНаСервере(ТекЛС)
	
	ТекОбъект 			= РеквизитФормыВЗначение("Объект");
	ТабЛокальныеСметы 	= ТекОбъект.ЛокальныеСметы;
	НайденнаяСтрока 	= ТабЛокальныеСметы.Найти(ТекЛС);
	Если НайденнаяСтрока <> Неопределено Тогда
		
		НовыйНомер 		= НайденнаяСтрока.НомерПП - 1;
		НомерПредСтроки = НайденнаяСтрока.НомерПП;
		
		Если НовыйНомер = 0 Тогда
			НайденнаяСтрока.НомерПП = ТабЛокальныеСметы.Количество();
			ТекНомПП = 1;
			Для Каждого ТекСтрока Из ТабЛокальныеСметы  Цикл
				Если ТекСтрока <> НайденнаяСтрока Тогда
					ТекСтрока.НомерПП = ТекНомПП;
					ТекНомПП = ТекНомПП + 1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НайденнаяСтрока.НомерПП = НовыйНомер;
		    ИндексТекСтроки 		= ТабЛокальныеСметы.Индекс(НайденнаяСтрока);
			ПредСтрока 				= ТабЛокальныеСметы.Получить(ИндексТекСтроки-1);			
			ПредСтрока.НомерПП 		= НомерПредСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
	ТабЛокальныеСметы.Сортировать("НомерПП Возр");
	
	ЗначениеВРеквизитФормы(ТабЛокальныеСметы,"Объект.ЛокальныеСметы");
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаВверх(Команда)
	
	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		СтрокаВверхНаСервере(ТекДанные.Элемент);
		ОбновитьДеревоОС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтрокаВнизНаСервере(ТекЛС)
	
	ТекОбъект 			= РеквизитФормыВЗначение("Объект");
	ТабЛокальныеСметы 	= ТекОбъект.ЛокальныеСметы;
	НайденнаяСтрока 	= ТабЛокальныеСметы.Найти(ТекЛС);
	Если НайденнаяСтрока <> Неопределено Тогда
		
		НовыйНомер 		= НайденнаяСтрока.НомерПП + 1;
		НомерПредСтроки = НайденнаяСтрока.НомерПП;
		Если НовыйНомер > ТабЛокальныеСметы.Количество() Тогда
			НайденнаяСтрока.НомерПП = 1;
			ТекНомПП = 2;
			Для Каждого ТекСтрока Из ТабЛокальныеСметы  Цикл
				Если ТекСтрока <> НайденнаяСтрока Тогда
					ТекСтрока.НомерПП = ТекНомПП;
					ТекНомПП = ТекНомПП + 1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НайденнаяСтрока.НомерПП = НовыйНомер;
		    ИндексТекСтроки 		= ТабЛокальныеСметы.Индекс(НайденнаяСтрока);
			ПредСтрока 				= ТабЛокальныеСметы.Получить(ИндексТекСтроки+1);			
			ПредСтрока.НомерПП 		= НомерПредСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
	ТабЛокальныеСметы.Сортировать("НомерПП Возр");
	
	ЗначениеВРеквизитФормы(ТабЛокальныеСметы,"Объект.ЛокальныеСметы");
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаВниз(Команда)
	
	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		СтрокаВнизНаСервере(ТекДанные.Элемент);
		ОбновитьДеревоОС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуЛЗНаСервере(ТекСсылка)
	
	СтруктураОтбора 		= Новый Структура;
	МассивУдаляемыхСтрок 	= Новый Массив;
	НазваниеТЧ				= "";
	Если ТипЗнч(ТекСсылка) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		СтруктураОтбора.Вставить("ЛокальнаяСмета",ТекСсылка);		
		МассивУдаляемыхСтрок = Объект.ЛокальныеСметы.НайтиСтроки(СтруктураОтбора);
		НазваниеТЧ = "ЛокальныеСметы";
		ОчиститьИдРодителяЛС(ТекСсылка);
	ИначеЕсли ТипЗнч(ТекСсылка) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		СтруктураОтбора.Вставить("ЛимитированнаяЗатрата",ТекСсылка);	
		МассивУдаляемыхСтрок = Объект.ЛимитированныеЗатраты.НайтиСтроки(СтруктураОтбора);
		НазваниеТЧ = "ЛимитированныеЗатраты";
	КонецЕсли;
	
	Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из МассивУдаляемыхСтрок Цикл
			Объект[НазваниеТЧ].Удалить(ТекСтрока);
		КонецЦикла;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЛЗ(Команда)
	
	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	СсылкаЛС = ТекДанные.Элемент;
	ТекСтрока = СМ_СметныйСоставКлиент.ТекущаяСтрокаПослеУдаленияВДереве(ДеревоОС, ТекДанные);
	УдалитьСтрокуЛЗНаСервере(ТекДанные.Элемент);
	ОбновитьДеревоОС(ТекСтрока);
	ВывестиСоставОС();
	Если ТипЗнч(СсылкаЛС) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") 
		И ЭтаСметаРассчитана(СсылкаЛС) Тогда
		Записать();
		СМ_СметаВызовСервера.УдалитьДвижения(СсылкаЛС);
		СМ_СметаВызовСервера.УдалитьЛС(СсылкаЛС);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтаСметаРассчитана(СсылкаЛС)
   Возврат СсылкаЛС.СметаРассчитана;	
КонецФункции

&НаСервере
Процедура ОчиститьПодписиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодписи(Команда)
	ОчиститьПодписиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодписиИзСпискаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодписиИзСписка(Команда)
	
	ЗаполнитьПодписиИзСпискаНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ТипЦенПриИзменении()
	
	Если ЭтаФорма.ТипЦен = 2 Тогда
		Объект.БазисныеЦены = Ложь;
	Иначе
		Объект.БазисныеЦены = Истина;
	КонецЕсли;
	
	ОбновитьДеревоОС();
	ВывестиСоставОС();

	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ОчиститьИдРодителяЛС(ТекЛС = Неопределено)
	
	ПустаяСсылка = Документы.СМ_ОбъектнаяСмета.ПустаяСсылка();
	Если ТипЗнч(ТекЛС) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Если ТекЛС.ИдРодителя <> ПустаяСсылка Тогда
			Попытка 
				ТекОбъект 				= ТекЛС.ПолучитьОбъект();
				ТекОбъект.ИдРодителя 	= ПустаяСсылка;
				ТекОбъект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка изменения объекта %1'"), ТекЛС));
			КонецПопытки;
		КонецЕсли;
	Иначе
		Для Каждого ТекСтрока Из Объект.ЛокальныеСметы Цикл
			Если ТекСтрока.ЛокальнаяСмета.ИдРодителя <> ПустаяСсылка Тогда
				Попытка 
					ТекОбъект 				= ТекСтрока.ЛокальнаяСмета.ПолучитьОбъект();
					ТекОбъект.ИдРодителя 	= ПустаяСсылка;
					ТекОбъект.Записать();
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка изменения объекта %1'"), ТекСтрока.ЛокальнаяСмета));
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

	
&НаКлиенте
Процедура ОбновитьДеревоОС(СохраненнаяСтрока = Неопределено) 

	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	СтрокаДерева = Неопределено;
	СМ_СметныйСоставКлиент.СохранитьТекущийЭлемент(СтрокаДерева, ТекДанные, Элементы.ДеревоОС, ДеревоОС.ПолучитьЭлементы());
	Если СохраненнаяСтрока <> Неопределено Тогда
		СтрокаДерева.ТекущийЭлемент = СохраненнаяСтрока;
	КонецЕсли;
 	ОбновитьДеревоОСНаСервере();
	СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.ДеревоОС, ДеревоОС.ПолучитьЭлементы(), ДеревоОС, СтрокаДерева);
	                      	
КонецПроцедуры	
	
&НаСервере
Процедура ОбновитьДеревоОСНаСервере() 
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоОС", Тип("ДеревоЗначений"));
	ДеревоЗначений.Строки.Очистить();
	СМ_СметныйСоставВызовСервера.ВывестиДеревоОСПоТаблице(ДеревоЗначений,Объект);
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоОС");
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьТабДокПриИзменении(Элемент)
	
	Элементы.СоставСметы.Видимость = НЕ ЭтаФорма.СкрытьТабДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	ТекЭлемент = ТекДанные.Элемент;
	Если ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		СтандартнаяОбработка = Ложь;
	    Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЛимитированныеЗатраты;
		ТекИндекс = ПолучитьИндексТекСтроки(ТекЭлемент);
		Элементы.ЛимитированныеЗатраты.ТекущаяСтрока = ТекИндекс;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексТекСтроки(ТекСсылка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	НайденнаяСтрока = ТекОбъект.ЛимитированныеЗатраты.Найти(ТекСсылка,"ЛимитированнаяЗатрата");
	Если НайденнаяСтрока = Неопределено Тогда
		ТекИндекс = 0;		
	Иначе
		ТекИндекс = ТекОбъект.ЛимитированныеЗатраты.Индекс(НайденнаяСтрока);
	КонецЕсли;
	
	Возврат ТекИндекс;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПриИзмененииФорматаОкругления()
	
	ОбновитьДеревоОС();
	ВывестиСоставОС();
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоОСРасчетПриИзменении(Элемент)

	ТекДанные 	= Элементы.ДеревоОС.ТекущиеДанные;
	ДеревоОСРасчетПриИзмененииНаСервере(ТекДанные.Элемент,ТекДанные.Расчет);
	
КонецПроцедуры

&НаСервере
Процедура ДеревоОСРасчетПриИзмененииНаСервере(ТекЭлемент,ТекРасчет)
	
	СтруктураОтбора = Новый Структура;
	
	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		СтруктураОтбора.Вставить("ЛокальнаяСмета",ТекЭлемент);	
		МассивСтрок = Объект.ЛокальныеСметы.НайтиСтроки(СтруктураОтбора);
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда	
		СтруктураОтбора.Вставить("ЛимитированнаяЗатрата",ТекЭлемент);	
		МассивСтрок = Объект.ЛимитированныеЗатраты.НайтиСтроки(СтруктураОтбора);
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если МассивСтрок.Количество() > 0 Тогда
		ТекСтрока 			= МассивСтрок[0];	
		ТекСтрока.Расчет 	= ТекРасчет;
	КонецЕсли;	
	
КонецПроцедуры

// ДокторСофт
&НаКлиенте
&НаКлиенте
Процедура Мобильное(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не записан в базе!'"),СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	СписокУзлов = ПолучитьУзлыПоУмолчанию();
	Если СписокУзлов = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораУзлов", ЭтаФорма);
		ОткрытьФорму("Обработка.СМ_ВыборУзловМП.Форма.Форма",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли СписокУзлов.Количество() = 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораУзлов", ЭтаФорма);
		ОткрытьФорму("Обработка.СМ_ВыборУзловМП.Форма.Форма",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		МобильноеНаСервере(СписокУзлов);
		ВидимостьМобильнойКнопки();
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораУзлов(Результат, СтруктураПараметров) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(ОписаниеНастройки(
	"НастройкиПользователяСмета",
	"ОсновнойУзелМП",
	Результат));
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассивИОбновитьПовторноИспользуемыеЗначения(МассивСтруктур);
	
	МобильноеНаСервере(Результат);
	ВидимостьМобильнойКнопки();

КонецПроцедуры

Функция ОписаниеНастройки(Объект, Настойка, Значение)
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", Объект);
	Элемент.Вставить("Настройка", Настойка);
	Элемент.Вставить("Значение", Значение);
	
	Возврат Элемент;
	
КонецФункции


&НаСервере
Функция ПолучитьУзлыПоУмолчанию()
    СписокУзлов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойУзелМП");
	Возврат СписокУзлов;
КонецФункции

&НаСервере
Процедура МобильноеНаСервере(СписокУзлов)
	Для каждого ВыбУзел Из СписокУзлов Цикл
		Если ВыбУзел.Значение.Ссылка =  ПланыОбмена.СМ_ОбменСметаМобильное.ЭтотУзел() ИЛИ ВыбУзел.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		НайденаЛС = ВыбУзел.Значение.ДокументыДляОбмена.Найти(Объект.Ссылка,"ДокументОтбор");
		Если НайденаЛС = Неопределено Тогда
			Узел = ВыбУзел.Значение.ПолучитьОбъект();
			Стр = Узел.ДокументыДляОбмена.Добавить();
			Стр.ДокументОтбор = Объект.Ссылка;
			Для каждого Смета Из Объект.ЛокальныеСметы Цикл
				Стр = Узел.ДокументыДляОбмена.Добавить();
				Стр.ДокументОтбор = Смета.ЛокальнаяСмета;
			КонецЦикла;
			Узел.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
	|ИЗ
	|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
	|ГДЕ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
	Запрос.УстановитьПараметр("Док",Объект.Ссылка);
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Объект.Ссылка);
	
	Для каждого Смета Из Объект.ЛокальныеСметы Цикл 
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Смета.ЛокальнаяСмета);
		СМ_ОбменСМобильнымСервер.РегистрацияПозицийРазделов(МассивУзлов,Смета.ЛокальнаяСмета)
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Функция ЕстьУзлы()
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Возврат Результат.Пустой();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ВидимостьМобильнойКнопки() 
	ЕстьУзлы = ЕстьУзлы();
    Элементы.Мобильное.Видимость =  ?(ЕстьУзлы = Неопределено,Ложь,ЕстьУзлы);
	Элементы.УбратьМобильное.Видимость = ?(ЕстьУзлы = Неопределено,Ложь,Не ЕстьУзлы);
КонецПроцедуры

&НаКлиенте
Процедура УбратьМобильное(Команда)
	УбратьМобильноеНаСервере();
	ВидимостьМобильнойКнопки();
КонецПроцедуры

&НаСервере
Процедура УбратьМобильноеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
	|ИЗ
	|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
	|ГДЕ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
	Запрос.УстановитьПараметр("Док",Объект.Ссылка);
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов,Объект.Ссылка);
	Для каждого эл Из МассивУзлов Цикл
		Узел = эл.ПолучитьОбъект();
		НайденаЛС = Узел.ДокументыДляОбмена.Найти(Объект.Ссылка,"ДокументОтбор");
		Если Не НайденаЛС = Неопределено Тогда
			Узел.ДокументыДляОбмена.Удалить(НайденаЛС);
			Узел.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Объект.БазисныеЦены Тогда
		ЭтаФорма.ТипЦен	= 1;
	Иначе
		ЭтаФорма.ТипЦен	= 2;
	КонецЕсли;

	Элементы.СоставСметы.Видимость 	= Ложь;
	ЭтаФорма.СкрытьТабДок 			= Истина;
	
	ТолькоПросмотрФормы = СМ_СметаВызовСервера.РольТолькоПросмотр();
	Архив = (Объект.Статус = Перечисления.СМ_СтатусыСметныхДокументов.Архив);
	Админ = Пользователи.РолиДоступны("СМ_АдминистраторСмета, ПолныеПрава",,Ложь);
	ТолькоПросмотрФормы = ?(Архив,Архив,ТолькоПросмотрФормы);

	ОбновитьДеревоОСНаСервере(); 
	ВывестиСоставОС();
	
	// Заполнить настройки пользователя по умолчанию
	Если Объект.Ссылка.Пустая() Тогда
		СМ_СметаВызовСервера.ЗаполнитьНастройкиПользователяПоУмолчанию(Объект);
		Объект.ПроводитьОкругление 	= Истина;
		Объект.ФорматОкругления 	= 3;
	КонецЕсли;
	
	// Вывод информации о сводной смете
	СтрокаСС = СМ_СметаВызовСервера.ПолучитьТекстИнформацииОСводнойСмете(Объект.Ссылка);
	Если ЗначениеЗаполнено(СтрокаСС) Тогда 
		Элементы.СтрокаСводнаяСмета.Видимость = Истина;
		Элементы.СтрокаСводнаяСмета.Заголовок = СтрокаСС;
	Иначе
		Элементы.СтрокаСводнаяСмета.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Стройка") Тогда
		Объект.Стройка = Параметры.Стройка;
		СМ_СметаВызовСервера.ЗаполнитьНаименованиеНомерИзШаблона(Объект, Элементы.Наименование, "НумераторОбъектныхСмет");
	КонецЕсли;
	
	Если Параметры.Свойство("ЛимЗатрата") Тогда
		Стр = Объект.ЛимитированныеЗатраты.Выгрузить().Найти(Параметры.ЛимЗатрата,"ЛимитированнаяЗатрата");
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЛимитированныеЗатраты;
		Элементы.ЛимитированныеЗатраты.ТекущаяСтрока = Стр.НомерСтроки-1;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Оповещение открытых форм об изменении
	// ОповещаемСС.
	СписокСвязанных = ПолучитьСС(Объект.Ссылка);
	Если СписокСвязанных.Количество()>0 Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СписокСмет",СписокСвязанных);
		Оповестить("ОбновитьДеревоССОС",СтруктураПараметров);
	КонецЕсли;
	// Например обработки "Дерево смет"
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Стройка",Объект.Стройка);
	СтруктураПараметров.Вставить("Смета",Объект.Ссылка);
	Оповестить("ОбновитьДеревоСмет",СтруктураПараметров);
	ОбновитьДеревоОС();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Заполнение реквизита "ИдРодителя" для ЛС из табличной части "Локальные сметы"
	Для Каждого ТекСтрока Из Объект.ЛокальныеСметы Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ЛокальнаяСмета.ИдРодителя) Тогда
			Попытка 
				ТекОбъект 				= ТекСтрока.ЛокальнаяСмета.ПолучитьОбъект();
				ТекОбъект.ИдРодителя 	= Объект.Ссылка;
				ТекОбъект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка изменения объекта %1'"), ТекСтрока.ЛокальнаяСмета));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Документы.СМ_ОбъектнаяСмета.Перерасчет(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = СМ_ЗащитаКлиент.ЗапускОбъекта();
	Если Не Отказ Тогда
		ВидимостьМобильнойКнопки();
		ВидимостьДоступностьЭлементовНаФорме();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 ЭтотОбъект.ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыЛимитированнаяЗатратаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПолучитьЛимитированныеЗатраты", ЭтотОбъект);
	ОткрытьФорму("Справочник.СМ_ЛимитированныеЗатраты.Форма.ФормаВыбораБезПомеченныхНаУдаление",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛимитированныеЗатраты(Результат, Структура) Экспорт
	Элементы.ЛимитированныеЗатраты.ТекущиеДанные.ЛимитированнаяЗатрата = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Расчет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыборИзШаблонаНаСервере(Ссылка)
	
	Смета = РеквизитФормыВЗначение("Объект");
	Смета.ЛимитированныеЗатраты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Шаблоны.ЛимЗатрата,
	               |	Шаблоны.Значение КАК ЗначениеПоУмолчанию
	               |ИЗ
	               |	Справочник.СМ_ШаблоныЛимитированныхЗатрат.ЛимитированныеЗатраты КАК Шаблоны
	               |ГДЕ
	               |	Шаблоны.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрЗапроса Из РезультатЗапроса Цикл
		НоваяСтрока = Смета.ЛимитированныеЗатраты.Добавить();
		НоваяСтрока.ЛимитированнаяЗатрата = СтрЗапроса.ЛимЗатрата;
		НоваяСтрока.ЗначениеЛимЗатраты = СтрЗапроса.ЗначениеПоУмолчанию;
		НоваяСтрока.БазисноеЗначениеЛимЗатраты = СтрЗапроса.ЗначениеПоУмолчанию;
		НоваяСтрока.Расчет = Истина;	
	КонецЦикла;
	ЗначениеВДанныеФормы(Смета, Объект);
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура осуществляет действия после закрытия формы выбора шаблона лим затрат для сметы.
// ПАРАМЕТРЫ:
//// Результат - ссылка на выбранный элемент.
//// Параметры - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораШаблона(Результат, Параметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ВыборИзШаблонаНаСервере(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыФормулаЛимЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.ЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаЛимЗатраты = ТекФормула;
		Попытка
			Формула = "ТекЗначение = " + ТекущиеДанные.ФормулаЛимЗатраты + "; ТекущиеДанные.ЗначениеЛимЗатраты = ТекЗначение;";
			Выполнить(Формула);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, значение затраты не изменено'"));
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыФормулаБазисногоЗначениеЛимЗатратыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.БазисноеЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты = ТекФормула;
		Попытка
			Формула = "ТекЗначение = " + ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты + "; ТекущиеДанные.БазисноеЗначениеЛимЗатраты = ТекЗначение;";
			Выполнить(Формула);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, значение затраты не изменено'"));
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыЗначениеЛимЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.ЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаЛимЗатраты = ТекФормула;
		РассчитанноеЗначение = 0;
		Попытка
			Формула = "РассчитанноеЗначение = " + ТекущиеДанные.ФормулаЛимЗатраты;
			Выполнить(Формула);
			Если ТекЗначение <>  РассчитанноеЗначение Тогда
				ПоказатьПредупреждение(,НСтр("ru= 'Значение затраты отличается от рассчитанного по формуле!'"));
			КонецЕсли;	
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, проверьте формулу'"));
		КонецПопытки;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыБазисноеЗначениеЛимЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.БазисноеЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты = ТекФормула;
		РассчитанноеЗначение = 0;
		Попытка
			Формула = "РассчитанноеЗначение = " + ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты;
			Выполнить(Формула);
			Если ТекЗначение <>  РассчитанноеЗначение Тогда
				ПоказатьПредупреждение(,НСтр("ru= 'Значение затраты отличается от рассчитанного по формуле!'"));
			КонецЕсли;	
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, проверьте формулу'"));
		КонецПопытки;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	Если Не ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		Состояние(НСтр("ru='Необходимо выбрать объектную смету.'"),100,"",БиблиотекаКартинок.Предупреждение32);
		Возврат;
	КонецЕсли;
	Элементы.ДеревоОС.ДобавитьСтроку();
	НовСтрока = Элементы.ДеревоОС.ТекущиеДанные;
	НовСтрока.Расчет = Истина;
	ТекСч = Объект.ЛокальныеСметы.Количество()+1;
	НовСтрока.НомерПП				= ТекСч;
	НовСтрока.НоваяЛС               = Истина;
	НовСтрока.СметаРассчитана = Истина;
	Элементы.ДеревоОС.ТекущийЭлемент = Элементы.ДеревоОСГруппа1.ПодчиненныеЭлементы.ДеревоОСНаимРаботИЗатрат;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоОСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элементы.ДеревоОС.ТекущиеДанные;
	Если ТекДанные.НоваяЛС Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Новый Структура("ТекДанные",ТекДанные));
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Сохранить локальную смету?';"+ " en = 'Do you want to continue?'"), Режим, 0);
	Иначе
		Рассчитана = СметаРассчитана(ТекДанные.Элемент);
		Если Рассчитана Тогда
			
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "ПрямЗатраты,ОснЗарплата,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекПрямЗатраты,ТекОснЗарплата,Смета,Итог";
			КонецЕсли;

			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.СтроительныеРаботы*1000,ТекДанные.ОплатаТруда*1000,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
			
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "ПрямЗатраты,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекПрямЗатраты,Смета,Итог";
			КонецЕсли;
			
			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.МонтажныеРаботы*1000,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
			
			
			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Прочие*1000,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
			
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "Оборуд,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекОборуд,Смета,Итог";
			КонецЕсли;
			
			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Оборудование*1000,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СметаРассчитана(СметаЭл)
	Если ТипЗнч(СметаЭл) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		И СметаЭл.СметаРассчитана Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекДанные = Параметры.ТекДанные;
		НоваяЛС = СМ_СметаВызовСервера.СоздатьНовуюЛокальнуюСметуРассчитанную(ТекДанные.НаимРаботИЗатрат,Объект.Ссылка,ТекДанные.НомерСметныхРасчетов);
		ТекДанные.НоваяЛС = Ложь;
		НоваяСтрока 					= Объект.ЛокальныеСметы.Добавить();
		НоваяСтрока.ЛокальнаяСмета 		= НоваяЛС;
		НоваяСтрока.КоличествоОбъектов 	= 1;
		НоваяСтрока.НомерПП				= ТекДанные.НомерПП;
		НоваяСтрока.Расчет				= Истина;
		
		Если Объект.БазисныеЦены Тогда
			ИмяРесурса = "ПрямЗатраты,ОснЗарплата,Смета,Итог";
		Иначе
			ИмяРесурса = "ТекПрямЗатраты,ТекОснЗарплата,Смета,Итог";
		КонецЕсли;
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.СтроительныеРаботы*1000,ТекДанные.ОплатаТруда*1000,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
		
		Если Объект.БазисныеЦены Тогда
			ИмяРесурса = "ПрямЗатраты,Смета,Итог";
		Иначе
			ИмяРесурса = "ТекПрямЗатраты,Смета,Итог";
		КонецЕсли;
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.МонтажныеРаботы*1000,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
		
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Прочие*1000,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
		
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "Оборуд,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекОборуд,Смета,Итог";
			КонецЕсли;
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Оборудование*1000,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);


		Записать();
		ОбновитьДеревоОС();
		ВывестиСоставОС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДеревоССОС" Тогда
		Если Параметр.Свойство("СписокСмет") Тогда
			ИндексСтроки = Параметр.СписокСмет.Найти(Объект.Ссылка);
			Если Не ИндексСтроки = Неопределено Тогда
				ОбновитьДеревоОС();
				// ОповещаемСС.
				СписокСвязанных = ПолучитьСС(Объект.Ссылка);
				Если СписокСвязанных.Количество()>0 Тогда
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("СписокСмет",СписокСвязанных);
					Оповестить("ОбновитьДеревоССОС",СтруктураПараметров);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСС(Смета)
	МассивСмет = Новый Массив;
	МассивСмет.Добавить(Смета);
	
	ВключитьОбъекты = Новый Массив;
	ВключитьОбъекты.Добавить(Метаданные.Документы.СМ_СводнаяСмета);
	
	ТабСсылок = НайтиПоСсылкам(МассивСмет, Новый Массив, ВключитьОбъекты);	
	Возврат ТабСсылок.ВыгрузитьКолонку("Данные");
КонецФункции

&НаСервере
Процедура ОбработатьЛимЗатратыСметы(Смета) 
	ИспользоватьЛимЗатратыВсегда = СМ_СметаВызовСервера.ЗначениеОпции("СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет");
	Если Не ИспользоватьЛимЗатратыВсегда Тогда
		Если Смета.ЛимитированныеЗатраты.Количество()>0 Тогда
			ОбСмета = Смета.ПолучитьОбъект();
			ТЗ = ОбСмета.ЛимитированныеЗатраты.Выгрузить();
			ТЗ.ЗаполнитьЗначения(Ложь,"Расчет");
			ОбСмета.ЛимитированныеЗатраты.Загрузить(ТЗ);
			ОбСмета.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Лимитированные затраты локальной сметы при включении ее в состав объектной сметы при расчете не учитываются.'"));
			// Очищаем движения по локальной смете.
			Отбор = Новый Структура("Смета",Смета);
			СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоГлавам", Отбор, Новый ТаблицаЗначений);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтрокаСводнаяСметаНажатие(Элемент)
	Если ТипЗнч(Объект.ИДРодителя) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		Пар = Новый Структура("Ключ", Объект.ИДРодителя);
		ОткрытьФорму("Документ.СМ_СводнаяСмета.ФормаОбъекта",Пар,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеНаФорме(Текст)
	
	Элементы.ТекстПредупреждения.Видимость 		= Истина;
	Элементы.ТекстПредупреждения.Доступность 	= Истина;
	ТекстПредупреждения = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПредупреждениеНаФорме()
	
	Элементы.ТекстПредупреждения.Видимость 		= Ложь;
	Элементы.ТекстПредупреждения.Доступность 	= Ложь;
	ТекстПредупреждения = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДоступностьЭлементовНаФорме()
	
	СкрытьПредупреждениеНаФорме();
	Если (Объект.Статус = ПредопределенноеЗначение("Перечисление.СМ_СтатусыСметныхДокументов.Согласован")) или ТолькоПросмотрФормы Тогда
		Если Не ТолькоПросмотрФормы Тогда
			ПоказатьПредупреждениеНаФорме(НСтр("ru='Смета согласована, для изменения смените статус!'"));
		КонецЕсли;
		Для каждого Элем Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элем) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элем) = Тип("ДополнениеЭлементаФормы") ИЛИ Элем = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Найти(ВРЕГ(Элем.Имя),"ПЕЧАТ")>0 ИЛИ Элем.Имя = "ФормаЗакрыть" 
				ИЛИ Элем.Имя = "УбратьМобильное" ИЛИ Элем.Имя = "Мобильное"
				ИЛИ Элем.Имя = "ФормаПрисоединенныеФайлы" ИЛИ Элем.Имя = "ФормаЗаписать" Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Элем) = Тип("КнопкаФормы") Тогда
				Элем.Доступность = Ложь;
			Иначе
				Элем.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Для каждого Элем Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элем) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элем) = Тип("ДополнениеЭлементаФормы") ИЛИ Элем = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Найти(ВРЕГ(Элем.Имя),"ПЕЧАТ")>0 ИЛИ Элем.Имя = "ФормаЗакрыть" 
				ИЛИ Элем.Имя = "УбратьМобильное" ИЛИ Элем.Имя = "Мобильное"
				ИЛИ Элем.Имя = "ФормаПрисоединенныеФайлы" ИЛИ Элем.Имя = "ФормаЗаписать" Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Элем) = Тип("КнопкаФормы") Тогда
				Элем.Доступность = Истина;
			Иначе
				Элем.ТолькоПросмотр = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Админ Тогда
		Элементы.Статус.ТолькоПросмотр = Ложь;
		Элементы.ГруппаГлавная.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СМ_СтатусыСметныхДокументов.Согласован") И Не Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
	ВидимостьДоступностьЭлементовНаФорме();

КонецПроцедуры

&НаСервере
Процедура ПерерасчетНаСервере()
	Документы.СМ_ОбъектнаяСмета.ПерерасчетПодчиненныхСмет(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Перерасчет(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ПерерасчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура НаименованиеОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Смета = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.СМ_ОбъектнаяСмета"));
	СМ_СметаВызовСервера.ЗаполнитьНомерПоСпискуВыбораШаблона(Смета, ВыбранноеЗначение, СтандартнаяОбработка, "НумераторОбъектныхСмет");
	ЗначениеВДанныеФормы(Смета, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НаименованиеОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтройкаПриИзменении(Элемент)
	СМ_СметаВызовСервера.ИзменитьСтройку(Объект.Ссылка,  Объект.Стройка);
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
